iPig/src/InformationRegisters/ЖурналОпороса/ЖурналОпороса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОпороса</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Живорожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мертвые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Слаборожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Муммии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Свинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереведеноПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСосков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГнезда</name>
    <type>
      <types>CatalogRef.НомерГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоОтец</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDГнезда</name>
    <type>
      <types>CatalogRef.IDГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОпороса/Forms/ФормаВводаДанных/Module.bsl
&НаКлиенте
Процедура ТЧОпоросНомерЖивотногоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Запись.ДатаСобытия = ТекущаяДата();
	СтандартнаяОбработка = Ложь;
	ДанныеПоСвиноматкам = _НастройкиКонфигурацииНаСервере.ПолучитьСписокСвиноматок(ВыбранноеЗначение);
	Если ДанныеПоСвиноматкам.Количество() <> 0 Тогда
		Если ДанныеПоСвиноматкам.Количество() = 1 Тогда
			Запись.НомерЖивотного = ДанныеПоСвиноматкам[0].Значение.НомерЖивотного;
			Запись.ДатаВвода	  = ДанныеПоСвиноматкам[0].Значение.ДатаВвода;
			Запись.КодПороды	  = ДанныеПоСвиноматкам[0].Значение.КодПороды;
		Иначе
			ВыбСтрокаМеню = ВыбратьИзМеню(ДанныеПоСвиноматкам);
			Если ВыбСтрокаМеню <> Неопределено Тогда
				Реквизиты = ВыбСтрокаМеню.Значение;
				Запись.НомерЖивотного = Реквизиты.НомерЖивотного;
				Запись.ДатаВвода	  = Реквизиты.ДатаВвода;
				Запись.КодПороды	  = Реквизиты.КодПороды;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Предупреждение("Свиноматки с таким номер нет");
	КонецЕсли;
	ПолучитьДанныеКоличествоОпорос();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеКоличествоОпорос()

	Перем Запись;

	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Элементы.ТЧОпоросНомерЖивотного.ТекстПодвала 		= ТЧОпорос.Количество();

КонецПроцедуры
&НаКлиенте
Процедура ТЧОпоросМассаВсегоПриИзменении(Элемент)
	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Если Запись.Живорожденные > КонстантаМаксимальноеКоличествоЖиворожденных() Тогда
		Предупреждение("Превышено максимальное количество живорожденных");
		Запись.Живорожденные = КонстантаМаксимальноеКоличествоЖиворожденных();
	КонецЕсли;
	Если Запись.Живорожденные <> 0 Тогда
		Запись.СреднийВес = Запись.МассаВсего / Запись.Живорожденные;
	КонецЕсли;
	Элементы.ТЧОпоросЖиворожденные.ТекстПодвала 	= ТЧОпорос.Итог("Живорожденные");
	Элементы.ТЧОпоросМассаВсего.ТекстПодвала 		= ТЧОпорос.Итог("МассаВсего");
	Элементы.ТЧОпоросСреднийВес.ТекстПодвала 		= ТЧОпорос.Итог("СреднийВес");
	Элементы.ТЧОпоросМертвые.ТекстПодвала 			= ТЧОпорос.Итог("Мертвые");
	Элементы.ТЧОпоросМуммии.ТекстПодвала 			= ТЧОпорос.Итог("Муммии");
	Элементы.ТЧОпоросСлаборожденные.ТекстПодвала 	= ТЧОпорос.Итог("Слаборожденные");
	Элементы.ТЧОпоросСвинки.ТекстПодвала 			= ТЧОпорос.Итог("Свинки");
	Элементы.ТЧОпоросНомерЖивотного.ТекстПодвала 	= ТЧОпорос.Количество();

КонецПроцедуры

&НаСервере
Функция КонстантаМаксимальноеКоличествоЖиворожденных()

	Возврат Константы.МаксимальноеКоличествоЖиворожденных.Получить();

КонецФункции

&НаКлиенте
Процедура ЗаписатьОпоросы(Команда)
	Для Каждого Запись Из ТЧОпорос Цикл
		Попытка
			СоздатьЗаписиОпоросНаСервере(Запись.ДатаСобытия, Запись.НомерЖивотного, Запись.КодПороды, Запись.ДатаВвода,
				Запись.Живорожденные, Запись.Мертвые, Запись.Слаборожденные, Запись.Муммии, Запись.Свинки,
				Запись.МассаВсего, Запись.СреднийВес, Запись.ПереведеноПоросят, Запись.IDГнезда, Запись.Место,
				Запись.ТолщинаШпика, Запись.КоличествоСосков);
			_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Данные внесены для свиноматки " + Запись.НомерЖивотного;
			Сообщение.Сообщить();
		Исключение
			Ошибка = ОписаниеОшибки();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =   "--------------------------------------" + Символы.ПС + "Данные не были внесены"
				+ Символы.ПС + Прав(Ошибка, СтрДлина(Ошибка) - СтрНайти(Ошибка, "}", НаправлениеПоиска.СКонца) - 2)
				+ Символы.ПС + "--------------------------------------";
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписиОпоросНаСервере(ДатаОпороса, НомерЖивотного, КодПороды, ДатаВвода, Живорожденные, Мертвые,
	Слаборожденные, Муммии, Свинки, МассаВсего, СреднийВес, ПереведеноПоросят, IDГнезда, Место, ТолщинаШпика,
	КоличествоСосков)
	Перем Записи;

	Записи = РегистрыСведений.ЖурналОпороса.СоздатьМенеджерЗаписи();
	Записи.Период		  		= ДатаОпороса;
	Записи.НомерЖивотного 		= НомерЖивотного;
	Записи.КодПороды			= КодПороды;
	Записи.ДатаВвода	  		= ДатаВвода;  //Дописать  
	Записи.IDГнезда		  		= IDГнезда;
	Записи.Живорожденные  		= Живорожденные;
	Записи.Мертвые		  		= Мертвые;
	Записи.Слаборожденные 		= Слаборожденные;
	Записи.Муммии		  		= Муммии;
	Записи.Свинки		  		= Свинки;
	Записи.МассаВсего     		= МассаВсего;
	Записи.СреднийВес	  		= СреднийВес;
	Записи.ПереведеноПоросят 	= ПереведеноПоросят;
	Записи.Место				= Место;
	Записи.ТолщинаШпика			= ТолщинаШпика;
	Записи.КоличествоСосков		= КоличествоСосков;
	Записи.Записать();
КонецПроцедуры

&НаСервере
Процедура ПечатьСпискаНаСервере(ТабДок)
	Перем Колонка, ПострПечать;

	ТаблицаДанные = Новый ТаблицаЗначений;
	ТаблицаДанные = ТЧОпорос.Выгрузить();

	ПострПечать = Новый ПостроительОтчета;
	ПострПечать.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаДанные);
	ПострПечать.Макет = РегистрыСведений.ЖурналОпороса.ПолучитьМакет("Макет"); 
//	ПострПечать.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Интерфейс);
	ПострПечать.Выполнить();
	Для Каждого Колонка Из ПострПечать.ВыбранныеПоля Цикл
		Колонка.Представление = ТаблицаДанные.Колонки[Колонка.Имя].Заголовок;
	КонецЦикла;
	ПострПечать.Вывести(ТабДок);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСписка(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьСпискаНаСервере(ТабДок);
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();
КонецПроцедуры
